{"bltae88b304854f29e2":{"title":"Contentstack Overview","url":"/blog/contentstack-overview","short_title":"Contentstack is a content management system, but a headless one. It provides the infrastructure to create and manage content, but it is not coupled to any single presentation layer, such as websites (which is commonly the case with today’s CMSs).","description":"<p><em>Contentstack is a CMS backend for your digital properties</em></p>\n<p>Contentstack is a content management system, but a headless one. It provides the infrastructure to create and manage content, but it is not coupled to any single presentation layer, such as websites (which is commonly the case with today’s CMSs).</p>\n<p>It is headless, which means it can serve content in a presentation-independent way. It provides REST APIs to deliver content to any channel such as websites, mobile apps, devices, marketing kiosks or any digital platform that displays content.</p><h3>How it works</h3>\n<p><strong>Step 1 - Model your content</strong>: Define the structure of your content in a platform-independent way. This involves creating a content type and adding relevant fields such as ‘single-line textbox’, ‘date’, ‘file’. Adding fields is a simple drag-and-drop process.</p>\n<p><strong>Step 2 - Create content</strong>: Once the required content types are ready, any user can add content, which is like filling up a form. Multiple users can work together in teams to create important content in multiple languages.</p>\n<p><strong>Step 3 - Publish content</strong>: The content, once created, can be published to your website, mobile app, or any other channel. The same content can be reused for any platform.</p>","authors":[{"uid":"bltef90481e3ec4541f","_content_type_uid":"authors"}],"tags":[],"locale":"en-us","uid":"bltae88b304854f29e2","ACL":{},"_version":4,"_in_progress":false,"publish_details":[{"environment":"blt6a970a5e360e342f","locale":"en-us","time":"2020-10-25T15:35:53.261Z","user":"blt1d7a52a45d858cdb","version":4}]},"blt2d83b42685d68c37":{"title":"Streamline Publishing with Workflows","url":"/blog/streamline-publishing-with-workflows","short_title":"Workflow is a tool that allows you to streamline the process of content creation and publishing. It lets you better manage the content lifecycle of your project.","description":"<p>Workflow is a tool that allows you to streamline the process of content creation and publishing. It lets you better manage the content lifecycle of your project....</p>\n<p>Only the Owner(s)/Admin(s) of a stack can define a Workflow, depending on the content requirements of the stack.</p><h3>How Workflow Stages work</h3>\n<p>Workflow Stages are the states of the content lifecycle which your content (entries) pass through on their way to being published. These might include, for example, ‘Draft’, ‘Ready for Review’, ‘Needs Changes’, ‘Add Media Files’, ‘Needs SEO’, ‘First Review Done’, and ‘Complete’.</p>\n<p>Contentstack provides two default stages: Draft and Complete. Owners/Admins can add custom stages between these two default stages, depending on the content requirements of the stack. Learn how to add Workflow Stages.</p>\n<p>Once added and enabled, these stages are visible on every entry of all the content types of the stack. They help content managers identify the levels which content has to go through, and then push content from one stage to another.</p>\n<p>Whenever a new entry is created by a user, it is always assigned the ‘Draft’ stage. Users can work on a stage, and then assign the next stage to other users along with a Due Date and a Note. Learn how to manage/change Workflow Stages.</p>\n<p>Every time an entry is assigned to a user, it is added as a new task in the assignee’s ‘My Task’ section. From this section, the user can go to the entry, work on it, and then assign it to another user. Similarly, the process continues until the entry reaches the end of the content creation lifecycle (i.e., ‘Complete’ stage). Learn about ‘My Tasks’.</p>","authors":[{"uid":"bltef90481e3ec4541f","_content_type_uid":"authors"}],"tags":[],"locale":"en-us","uid":"blt2d83b42685d68c37","ACL":{},"_version":1,"_in_progress":false,"publish_details":[{"environment":"blt6a970a5e360e342f","locale":"en-us","time":"2020-10-25T15:34:11.236Z","user":"blt1d7a52a45d858cdb","version":1}]},"blt6e16d60ec78b312d":{"title":"Contentstack API","url":"/blog/contentstack-api","short_title":"Contentstack is an API-first CMS platform. This essentially means that it provides REST APIs for anything you wish to do with your content. For easy access, our APIs are split into two sets: Content Management API and Content Delivery API.","description":"<p><em>Manage and interact with your content using Contentstack’s APIs</em></p>\n<p>Contentstack is an API-first CMS platform. This essentially means that it provides REST APIs for anything you wish to do with your content. For easy access, our APIs are split into two sets: Content Management API and Content Delivery API.</p>\n<p><strong>Content Delivery APIs</strong>: This read-only set of APIs helps you fetch content from Contentstack, and deliver it to any external channel: websites, mobile devices, wearable devices, store displays, or any other media. </p>\n<p><strong>Content Management APIs</strong>: A set of read-write APIs that enables you to interact with the information and perform any tasks within your Contentstack account. You can create/edit/delete entries and assets, manage content types, etc. using these APIs.</p>\n<p><strong>Image Delivery APIs</strong>: These read-only APIs enable you to retrieve images from your stack and manipulate them to deliver modified images to your digital property. You can perform basic operations such set height/width, crop, trim, modify device pixel ratio, change quality, etc. of images using these APIs.</p>","authors":[{"uid":"bltef90481e3ec4541f","_content_type_uid":"authors"}],"tags":[],"locale":"en-us","uid":"blt6e16d60ec78b312d","ACL":{},"_version":2,"_in_progress":false,"publish_details":[{"environment":"blt6a970a5e360e342f","locale":"en-us","time":"2020-10-25T15:34:19.564Z","user":"blt1d7a52a45d858cdb","version":2}]}}